'''
Вправа 2

Послідовність складається з цілих чисел і закінчується номером 0.
Визначте, скільки елементів цієї послідовності більше наступного елемента.
Вводиться послідовність цілих чисел, що закінчується числом 0 (саме число 0 в послідовність не входить, а використовується як ознака її закінчення).
Гарантується, що послідовність містить як мінімум два числа.

Токар Іван
'''
prev_num = int(input("Enter a number: "))
count = 0
while True:
    num = int(input("Enter a number: "))
    if num == 0:
        break
    if num > prev_num:
        count += 1
    prev_num = num
print(count)